Repository: dreshetnyak/DuplicateFileTool
Catalog: DuplicateFileTool/Properties/Resources.*.resx
Languages: es, ru

# Ui_Results_Selected_for_deletion_size
source: To be Deleted:
es: Para Borrar:
ru: К Удалению:

# Ui_Results_Sorting_By_Name
source: Name
es: Nombre
ru: Имя

# Ui_Results_Sorting_By_Number
source: Number
es: Numero
ru: Номер

# Ui_Results_Sorting_By_Path
source: Path
es: Ruta
ru: Путь

# Ui_Results_Sorting_By_Size
source: Size
es: Tamaño
ru: Размер

# Ui_Results_Sort_By
source: Sort by:
es: Ordenar por:
ru: Сортировать по:

# Ui_Results_Tab_Header
source: Results
es: Resultados
ru: Результаты

# Ui_Search_Button_Text
source: Search Duplicates
es: Buscar Duplicados
ru: Поиск Дубликатов

# Ui_Search_Extensions_Exclude
source: Exclude
es: Excluir
ru: Исключить

# Ui_Search_Extensions_Include
source: Include
es: Incluir
ru: Включить

# Ui_Search_Paths_Header_Inclusion
source: Inclusion
es: Inclusión
ru: Включение

# Ui_Search_Paths_Header_Path
source: Path
es: Ruta
ru: Путь

# Ui_Search_Path_Exclude
source: Exclude
es: Excluir
ru: Исключить

# Ui_Search_Path_Include
source: Include
es: Incluir
ru: Включить

# Ui_Search_Size_Maximum_Label
source: Maximum:
es: Máximo:
ru: Максимум:

# Ui_Search_Size_Minimum_Label
source: Minimum:
es: Mínimo:
ru: Минимум:

# Ui_Search_Tab_Header
source: Search
es: Búsqueda
ru: Поиск

# Ui_Settings_Tab_Header
source: Settings
es: Ajustes
ru: Настройки

# Ui_Size_GroupBox_Header
source: Size
es: Tamaño
ru: Размер

# Ui_ToolTip_Add_Or_Remove_Search_Extensions
source: Add or remove search extensions
es: Agregar o remover extensiones para búsqueda
ru: Добавить или удалить расширения файлов для поиска

# Ui_ToolTip_Add_selected_to_the_list
source: Add selected to the list
es: Agregar el seleccionado a la lista
ru: Добавить выбранный в список

# Ui_ToolTip_Clear_Extensions_List
source: Clear extensions list
es: Vaciar la lista de extensiones
ru: Очистить список расширений файлов

# Ui_ToolTip_Clear_Search_Paths
source: Clear search paths
es: Vaciar la lista de rutas
ru: Очистить список путей поиска

# Ui_ToolTip_Config_Extensions
source: Search extensions default parameters configuration
es: La configuración de los parámetros predeterminados de las Extensiones de búsqueda
ru: Параметры по умолчанию расширений файлов используемых для поиска дубликатов

# Ui_ToolTip_Config_Results
source: Results page default parameters configuration
es: La configuración de los parámetros predeterminados de la página de Resultados
ru: Параметры по умолчанию используемые на странице результатов поиска

# Ui_ToolTip_Config_Search
source: Search page default parameters configuration
es: La configuración de los parámetros predeterminados de la página de Búsqueda
ru: Параметры по умолчанию используемые на странице поиска дубликатов

# Ui_Tooltip_Count_size_in_Bytes
source: Count the entered size in Bytes
es: El tamaño ingresado esta en Bytes
ru: Введённый размер исчисляется в Байтах

# Ui_Tooltip_Count_size_in_Gigabytes
source: Count the entered size in Gigabytes
es: El tamaño ingresado esta en Gigabytes
ru: Введённый размер исчисляется в Гигабайтах

# Ui_Tooltip_Count_size_in_Kilobytes
source: Count the entered size in Kilobytes
es: El tamaño ingresado esta en Kilobytes
ru: Введённый размер исчисляется в Килобайтах

# Ui_Tooltip_Count_size_in_Megabytes
source: Count the entered size in Megabytes
es: El tamaño ingresado esta en Megabytes
ru: Введённый размер исчисляется в Мегабайтах

# Ui_ToolTip_Errors_Tab
source: Duplicate file search errors
es: Los errores de la búsqueda de los archivos duplicados
ru: Ошибки поиска дубликатов файлов

# Ui_ToolTip_Files_with_the_listed_extensions_will_be_excluded
source: The files with the listed extensions will be excluded from the search
es: Los archivos con las extensiones de la lista serán excluidos de la búsqueda
ru: Файлы с расширениями присутствующими в списке будут исключены из поиска

# Ui_ToolTip_Only_the_files_with_the_listed_extensions_included
source: Only the files with the listed extensions will be included in the search
es: Solamente los archivos con las extensiones de la lista serán incluidos en la búsqueda
ru: Только файлы с расширениями присутствующими в списке будут включены в поиск

# Ui_ToolTip_Open_File_In_Explorer
source: Open the file in explorer
es: Abrir en el Explorador
ru: Открыть в менеджере файлов

# Ui_ToolTip_Results_Page_First
source: Go to the first page
es: Ir a la primera pagina
ru: Первая страница

# Ui_ToolTip_Results_Page_Last
source: Go to the last page
es: Ir a la última pagina
ru: Последняя страница

# Ui_ToolTip_Results_Page_Next
source: Go to the next page
es: Ir a la siguiente pagina
ru: Следующая страница

# Ui_ToolTip_Results_Page_Previous
source: Go to the previous page
es: Ir a la previa pagina
ru: Предыдущая страница

# Ui_ToolTip_Results_Tab
source: Duplicate file search results
es: Los resultados de la búsqueda de los archivos duplicados
ru: Результаты поиска дублированных файлов

# Ui_ToolTip_Search_Tab
source: Duplicate files search
es: Búsqueda de los archivos duplicados
ru: Поиск дублированных файлов

# Ui_ToolTip_Settings_Tab
source: Duplicate file tool settings
es: Los ajustes de la programa
ru: Настройки программы

# Ui_ToolTip_Toggle_Mark_For_Deletion
source: Select for deletion
es: Seleccionar para eliminación
ru: Выбрать к удалению

# Ui_ToolTip_Toggle_Unmark_For_Deletion
source: Unmark
es: Deseleccionar
ru: Отменить выбор

# Warning_Encountered_a_group_with_all_files_selected
source: Invalid selection, encountered a group with all files selected, at least one file should be left unselected. The group will be ignored.
es: Selección invalida, fue encontrado un grupo con todos los archivos seleccionados, por lo menos un archivo debe permanecer no seleccionado. El grupo será ignorado.
ru: Обнаружена некорректная выборка, в группе файлов выбраны все файлы, по крайней мере один файл должен быть не выбран. Группа будет пропущена.

# Ui_AutoSelectByPath_Finished
source: Done. Selected {0:N0} files.
es: Listo. Había seleccionado {0:N0} archivos.
ru: Готово. Выбрано {0:N0} файлов.

# Ui_AutoSelectByPath_Progress
source: Selecting files. Selected {0:N0} files.
es: Seleccionando archivos. Ha seleccionado {0:N0} archivos.
ru: Выбор файлов. Выбрано {0:N0} файлов.

# Ui_ToolTip_Results_Filter_Entry
source: Enter keywords separated by space to filter the results that is shown
es: Entra las palabras clave separados con espacio para refinar los resultados mostrados
ru: Введите ключевые слова, разделённые пробелами для фильтрации отображённых результатов

# Ui_Results_Filter_Watermark
source: Filter Results
es: Filtro de resultados
ru: Фильтр результатов

# Ui_ToolTip_Results_Filter_Clear
source: Clear
es: Borrar
ru: Очистить
