Repository: dreshetnyak/DuplicateFileTool
Catalog: DuplicateFileTool/Properties/Resources.*.resx
Languages: es, ru

# Configur_SelectedFileComparerGuid_Description
source: The file comparer that should be used to compare files during the duplicates search.
es: El comparador de los archivos que debe ser utilizado para la búsqueda de los archivos duplicados.
ru: Компаратор файлов, который будет использоваться для поиска дубликатов.

# Configur_SelectedFileComparerGuid_Name
source: Selected file comparer
es: Comparador de archivos seleccionado
ru: Выбранный компаратор

# Config_ByteSizeUnit_Description
source: Byte size units of the number entered in Min/Max file size field.
es: Unidades de tamaño ingresados en el campo de Min/Max tamaño de los archivos.
ru: Единицы байтового размера значений, введённых в полях Мин./Макс. размер файла.

# Config_ByteSizeUnit_Name
source: Size units
es: Unidades de tamaño
ru: Единицы размера

# Config_ComparableFileHash_HashChunkSize_Description
source: This file comparing algorithm does not compare the files byte to byte, but divides the file to chunks and calculates the hash of the chunks and then compares the hash, this parameter specifies the size of the chunk to be used. A smaller value will lead to a faster comparison but will consume more memory, a bigger value will lead to slower comparison, but will require less memory.
es: Este algoritmo en vez de comparar los archivos byte a byte divida los archivos en fracciones, calcula el hash de las fracciones y después compara el hash, este parámetro especifica el tamaño de fracción que debe ser usada. El valor más pequeño resultara en la comparación más rápida pero consumirá más memoria, el valor más grande, al contrario resultara en comparación más lenta pero va a consumir menos memoria.
ru: Данный алгоритм сравнения файлов не производит сверку байт к байту, а вместо этого разбивает файл на фрагменты вычисляет хэш данных фрагментов, после чего осуществляет сравнение хэшев. Данный параметр задаёт размер фрагментов хэша. Чем меньше значение, тем быстрее будет проходить сравнение файлов, но как результат программа будет требовать больше памяти, большее значение наоборот вызовет более медленное сравнение и меньший расход памяти.

# Config_ComparableFileHash_HashChunkSize_Name
source: Hash chunk size
es: Tamaño de fracciones para Hash
ru: Размер фрагмента для хэша

# Config_Comparer_CompleteMatch_Description
source: Comparison match points with value greater or equal to this value will cause for the files to be considered matching
es: El puntaje de comparación con valor que es igual o excede el valor especificado por acá resultara en que los archivos serán considerados iguales.
ru: Если очки вычисленные в результате сравнения файлов равны или превышают данное значение, то файлы будут считаться дубликатами.

# Config_Comparer_CompleteMatch_Name
source: Comparer Match Value
es: Valor de Igualdad de Comparación
ru: Значение Совпадения Компаратора

# Config_Comparer_CompleteMismatch_Description
source: Comparison match points with value less or equal to this value will cause for the files to be considered mismatching
es: El puntaje de comparación con valor que es igual o menos del valor especificado por acá resultara en que los archivos serán considerados desiguales.
ru: Если очки вычисленные в результате сравнения файлов равны или меньше данного значения, то файлы будут считаться разными.

# Config_Comparer_CompleteMismatch_Name
source: Comparer Mismatch Value
es: Valor de Desigualdad de comparación
ru: Значение Несовпадения Компаратора

# Config_Comparer_Description
source: Description:
es: Descripción:
ru: Описание:

# Config_Comparer_Description_Description
source: Description of the comparer
es: Descripción del Comparador
ru: Описание Компаратора

# Config_Comparer_Description_Name
source: Comparer Description
es: Descripción del Comparador
ru: Компаратор

# Config_Comparer_MatchThreshold_Description
source: When the files match points generated by comparison is greater or equal than this value the search engine will consider those values matching
es: Cuando los puntos de comparación calculados es mayor o igual a este valor el motor de la búsqueda va a considerar estos archivos como iguales
ru: Если очки вычисленные в результате сравнения файлов равны или превышают данное значение, то файлы будут считаться дубликатами.

# Config_Comparer_MatchThreshold_Name
source: Comparer Match Threshold
es: Umbral de Igualdad del Comparador
ru: Порог Совпадения Компаратора

# Config_Comparer_Name_Description
source: Short name of the comparer
es: Nombre corto del comparador
ru: Описание компаратора

# Config_Comparer_Name_Name
source: Comparer Name
es: Nombre del comparador
ru: Имя Компаратора

# Config_DataGrid_Header_Description
source: Description
es: Descripción
ru: Описание

# Config_DataGrid_Header_Name
source: Name
es: Nombre
ru: Имя

# Config_DataGrid_Header_Value
source: Value
es: Valor
ru: Значение

# Config_ExcludeHiddenFiles_Description
source: If enabled the program will skip the hidden files and directories.
es: Si habilitado la búsqueda excluirá los archivos y carpetas ocultos.
ru: Если данная опция включена, то поиск дубликатов исключит скрытые файлы и директории.

# Config_ExcludeHiddenFiles_Name
source: Exclude hidden files and directories
es: Excluir archivos y carpetas ocultos
ru: Исключить скрытые файлы и директории

# Config_ExcludeOsFiles_Description
source: If enabled the program will skip the OS files and directories, such as windows directory and others known directories that belong to the operating system.
es: Si habilitado la búsqueda excluirá los archivos y carpetas que pertenecen al Sistema Operativo, tales como la carpeta Windows u otros conocidos.
ru: Если опция включена программа исключит из поиска файлы принадлежащие системе, такие как директория Windows и другие.

# Config_ExcludeOsFiles_Name
source: Exclude OS files and directories
es: Excluir los archivos y carpetas de OS
ru: Исключить системные файлы и директории

# Config_ExcludeSystemFiles_Description
source: If enabled the program will skip the files and directories that has the system attribute set.
es: Si habilitado la programa excluirá de la búsqueda los archivos y carpetas que tienen habilitado el atributo de sistema
ru: Если опция включена программа исключит из поиска файлы и директории имеющие системный атрибут.

# Config_ExcludeSystemFiles_Name
source: Exclude system files and directories
es: Excluir los archivos y carpetas del sistema
ru: Исключить системные файлы и директории

# Config_ExtensionInclusionType_Description
source: Specifies if the listed extensions have to be included or excluded from the search
es: Especifica si las extensiones de los archivos ubicados en la lista deben ser incluidos o excluidos de la búsqueda
ru: Список расширений файлов, которые должны быть включены или исключены из поиска

# Config_ExtensionInclusionType_Name
source: Extension inclusion type
es: Tipo de inclusión de extensiones
ru: Тип включения расширений

# Config_Extensions_Description
source: Those extensions will be included in the dialog that adds or removes extensions from the search
es: Estas extensiones serán incluidos en el dialogo que agrega o remueve las extensiones de la lista para la búsqueda
ru: Данные расширения файлов будут присутствовать в диалоге добавления-удаления расширений для поиска

# Config_Extensions_Header
source: Extensions Configuration
es: Ajustes de Extensiones
ru: Настройки Расширений

# Config_Extensions_Name
source: Configured extensions
es: Extensiones configuradas
ru: Расширения Файлов

# Config_Language_Restart_To_Change
source: * Restart the program to apply the language change.
es: * Reinicia el programa para aplicar el cambio de idioma.
ru: * Требуется перезапуск программы для смены языка.

# Config_MaxFileSize_Description
source: The file size above which the file will be excluded from the results
es: Los archivos con el tamaño que excede este valor serán excluidos de la búsqueda
ru: Файлы с размером, превышающим данное значение будут исключены из поиска

# Config_MaxFileSize_Name
source: Maximum file size
es: Tamaño máximo de archivo
ru: Максимальный размер файла

# Config_MaximumFilesOpenedAtOnce_Description
source: Specifies the maximum count of files that the program will keep open after reaching which the program will start closing the files opened previously. The low value will negatively impact performance, the high value will cause the program to consume too many resources.
es: Especifica la cantidad máxima de los archivos abiertos al mismo tiempo. Después de alcanzar esta cantidad el programa empezara a cerrar los archivos abiertos anteriormente. El valor bajo impactara de forma negativa el rendimiento de la búsqueda, el valor alto causara que la programa consuma la gran cantidad de recursos.
ru: Задаёт максимальное количество одновременно открытых файлов после которого программа начнёт закрывать раннее открытые. Низкое значение будет негативно влиять на производительность, высокое значение приведёт к повышенному потреблению ресурсов.

# Config_MaximumFilesOpenedAtOnce_Name
source: Maximum files opened at once
es: Cantidad de archivos abiertos simultáneamente
ru: Максимальное количество файлов, открытых одновременно

# Config_MinFileSize_Description
source: The file size below which the file will be excluded from the results
es: Los archivos con el tamaño debajo de este valor serán excluidos de la búsqueda
ru: Файлы с размером менее данного значения будут исключены из поиска.

# Config_MinFileSize_Name
source: Minimum file size
es: Tamaño mínimo de archivo
ru: Минимальный размер файла

# Config_Results_Delete_To_Recycle_Bin_Description
source: Indicates if the duplicated files and directories should be deleted to the recycle bin or deleted permanently
es: Indica si los archivos duplicados deben ser eliminados al papelera de reciclaje o eliminados de forma permanente
ru: Определяет должны ли файлы удаляться в корзину или сразу удаляться перманентно

# Config_Results_Delete_To_Recycle_Bin_Name
source: Delete to recycle bin
es: Borrar al papel de reciclaje
ru: Удалять в корзину

# Config_Results_Header
source: Results Configuration
es: Ajustes de Resultados
ru: Настройки Результатов

# Config_Results_Items_Per_Page_Description
source: How many duplicate groups to display on a single results page
es: Cantidad de los grupos de los duplicados que deben aparecer en una página de los resultados
ru: Определяет сколько групп дубликатов показывать на одной странице результатов

# Config_Results_Items_Per_Page_Name
source: Duplicate groups per page
es: Cantidad de grupos de duplicados por pagina
ru: Количество дубликатов на одной странице

# Config_Results_Remove_Empty_Directories_Description
source: Specifies if after deletion the file directory is empty if we should remove the empty directory or not
es: Especifica si después de eliminación de los duplicados la carpeta queda vacía si esta carpeta debe ser eliminada o no
ru: Определяет, что делать с директориями, которые остались пустыми после удаления дубликатов, если опция включена, то пустые директории будут удаляться

# Config_Results_Remove_Empty_Directories_Name
source: Remove empty directories
es: Remover carpetas vacías
ru: Удалять пустые директории

# Config_Results_Sort_Descending_Description
source: Indicates if the results should be sorted in a descending is checked or otherwise ascending order
es: Indica si los resultados de la búsqueda deben ser ordenados de forma descendente, al contario serán ordenados de forma ascendente
ru: Определяет должны ли результаты сортироваться по убыванию, иначе они будут отсортированы по возрастанию

# Config_Results_Sort_Descending_Name
source: Sort Results Descending
es: Ordenar Resultados Descendente
ru: Сортировать результаты по Убыванию

# Config_Results_Sort_Order_Description
source: Specified the duplicate group parameter to use for sorting results
es: Especifica el tipo de ordenamiento de los grupos de archivos duplicados en los resultados
ru: Задаёт параметр группы дубликатов по которому требуется сортировать результаты

# Config_Results_Sort_Order_Name
source: Sorting Order
es: Orden de Clasificación
ru: Порядок Сортировки

# Config_Search_Header
source: Search Configuration
es: Ajustes de Búsqueda
ru: Настройки Поиска

# Config_SelectedCulture_Description
source: Selected application language
es: Idioma del aplicativo seleccionada
ru: Выбранный язык программы

# Config_SelectedCulture_Name
source: Language
es: Idioma
ru: Язык

# Config_Selected_File_Comparer_Header
source: Selected File Comparer
es: Comparador de archivos seleccionado
ru: Выбранный Компаратор Файлов

# Config_Selected_Language
source: Application Language
es: Idioma del Aplicativo
ru: Язык Программы

# Error_ComparableFileHash_Cant_read_the_file
source: Can't read the file '{0}'.
es: No se pudo leer el archivo '{0}'.
ru: Ошибка чтения файла '{0}'.

# Error_ComparableFileHash_CompareTo_File_Comparer_type_mismatch
source: File comparer type mismatch
es: Discordancia del tipo de comparador de archivos
ru: Несовпадение типа компаратора файлов

# Error_ComparableFileHash_CompareTo_Fragment_Size_Mismatch
source: Comparing with the file hash object that has a different fragment size
es: Comparando con el objeto de hash que tiene un tamaño distinto de los fragmentos
ru: Попытка сравнения хэша файлов имеющий разный размер хэшируемых фрагментов

source: CompleteMatch and CompleteMismatch is defined incorrectly, CompleteMatch must be greater than CompleteMismatch
es: CompleteMatch y CompleteMismatch están definidos incorrectamente, CompleteMatch debe ser mayor que CompleteMismatch
ru: Параметры CompleteMatch и CompleteMismatch заданы некорректно, CompleteMatch должен быть больше CompleteMismatch

# Error_ComparableFileHash_Fragment_index_is_out_of_bounds
source: Fragment index '{0:N0}' is out of bounds, there is '{1:N0}' fragments in the file
es: El índice del fragmento '{0:N0}' está fuera de límites, existen '{1:N0}' fragmentos en el archivo
ru: Индекс фрагмента '{0:N0}' находится за допустимым пределом, файл содержит всего '{1:N0}' фрагментов

# Error_ComparableFileHash_Invalid_fragment_size
source: Invalid fragment size
es: Tamaño invalido del fragmento
ru: Некорректный размер фрагмента

# Error_ComparableFileHash_The_random_access_for_hashing_is_not_supported
source: The random access for hashing is not supported
es: El acceso aleatorio para calcular hash no está soportado
ru: Случайный доступ не поддерживается при хешировании

# Error_Compute_Hash_Compute_is_called_with_an_invalid_parameter
source: Hash.Compute is called with an invalid parameter 'dataForHash' that is null
es: El método Hash.Compute fue llamado con el parámetro 'dataForHash' invalido, el parámetro es null
ru: Hash.Compute был вызван с некорректным параметром 'dataForHash' равным null

# Error_Failed_to_close_the_file_search_handle
source: Failed to close the file search handle.
es: Fallo cerrar el descriptor de la búsqueda de archivos
ru: Ошибка закрытия дескриптора поиска файлов

# Error_Failed_to_find_the_next_file
source: Failed to find the next file.
es: Fallo de encontrar el siguiente archivo.
ru: Попытка найти следующий файл привела к ошибке.

# Error_File_not_found
source: File not found
es: Archivo no encontrado
ru: Файл не найден

# Error_File_x_not_found
source: The file '{0}' does not exist
es: El archivo '{0}' no existe
ru: Файл '{0}' не существует

# Error_The_value_is_greater_than_the_allowed_maximum
source: The value is greater than the allowed maximum
es: El valor excede el máximo permitido
ru: Значение превышает допустимый максимум

# Error_The_value_is_less_than_the_allowed_minimum
source: The value is less than the allowed minimum
es: El valor es menos del límite permitido
ru: Значение меньше допустимого минимума

# Error_The_value_is_not_a_an_integer
source: The value is not a an integer
es: El valor no es un numero integral
ru: Значение не является целым числом

# Error_The_value_is_not_a_valid_number
source: The value is not a valid number
es: El valor no es un numero valido
ru: Значение не является числом

# Error_Unable_to_convert_the_size_to_bytes_unknown_SizeUnits
source: Unable to convert the size to bytes, unknown SizeUnits parameter
es: Fallo de convertir el tamaño a los bytes, el parámetro SizeUnits esta desconocido
ru: Ошибка вычисления размера файла в байтах, значение параметра SizeUnits неизвестно

# Error_Unable_to_set_the_file_offset
source: Unable to set the file offset
es: Fallo de fijar el índice del archivo
ru: Ошибка установки смещения файла

# Error_Unknown_file_extension_inclusion_type
source: Unknown file extension inclusion type
es: El tipo de inclusión de extensión de archivos esta desconocido
ru: Неизвестный тип включения расширений файлов

# FileHashComparer_Description
source: Calculates file hash while read files, compares the hash values. The hash is cached to prevent reading files twice
es: Calcula hash de los archivos al leerlos, compara el hash para determinar si los archivos son iguales. El hash calculado está guardado en cache para prevenir la lectura doble de los archivos
ru: Разбивает файлы на фрагменты и вычисляет хэш данных фрагментов, затем сравнивает данные фрагменты для выявления дублированных файлов. Фрагменты хэша кэшируются для предотвращения повторного чтения файлов

# FileHashComparer_Name
source: File Hash Comparer
es: Comparador de Hash de Archivos
ru: Компаратор Хэша Файлов

# Log_Deleting_Name
source: Deleting: {0}
es: Borrando: {0}
ru: Удаление: {0}

# Log_Deleting_Name_Size
source: Deleting: {0}; {1}
es: Borrando: {0}; {1}
ru: Удаление: {0}; {1}

# Log_Deletion_Cancelled
source: Cancelled.
es: Cancelado.
ru: Отменён.

# Log_Deletion_Completed
source: Done.
es: Listo.
ru: Готово.

# Log_Error_Deletion_Failed
source: Failed to delete: '{0}'; {1}
es: Fallo de borrar: {0}; {1}
ru: Ошибка удаления: '{0}'; {1}

# Log_Files_Deletion_Summary
source: Deleted: {0:N0} files; Freed: {1:N0} bytes.
es: Borrado: {0:N0} archivos; Liberado: {1:N0} bytes.
ru: Удалено: {0:N0} файлов; Освобождено: {1:N0} байт.

# Log_Performing_deletion_of_the_marked_duplicates
source: Performing deletion of the marked duplicates.
es: Borrando los duplicados seleccionados.
ru: Осуществляется удаление выбранных дубликатов.

# Log_Unmarking_FullFileName
source: Unmarking: {0}
es: Deseleccionando: {0}
ru: Отменён выбор: {0}

# Ui_About_Program_Site
source: [Program Site]
es: [Sitio de Programa]
ru: [Сайт]

# Ui_About_Source_Site
source: [Source Code]
es: [Código Fuente]
ru: [Исходные Коды]

# Ui_About_the_Program_Header
source: About the program
es: Acerca de programa
ru: О программе

# Ui_About_the_Program_Text
source: Duplicate File Tool is a program for search and removal of a duplicated files. It is FREE and Open Source, made to be extensible with a different search algorithms.
es: Duplicate File Tool es un programa para búsqueda y remoción de los archivos duplicados. Es GRATUITA y el Código de Fuente Abierto, hecha de tal forma para ser extensible con los diferentes algoritmos de búsqueda.
ru: Duplicate File Tool программа для поиска и удаления дублированных файлов. Программа БЕСПЛАТНА и имеет Открытые Исходные Коды. Разработана с возможностью добавления различных алгоритмов поиска.

# Ui_About_Visit
source: Visit my pages:
es: Visita mis páginas:
ru: Посети:

# Ui_Add_Or_Remove_Search_Extensions_Title
source: Add or remove extensions
es: Agregar o remover extensiones
ru: Добавить или Удалить Расширения

# Ui_AutoSelectByPath_Description
source: Select the path where the duplicated files should be automatically selected for deletion.
es: Seleccione la ruta donde los archivos duplicados serán automáticamente marcados en los resultados de búsqueda para remoción.
ru: Выбрать путь, по которому все дублированные файлы будут автоматически помечены для удаления.

# Ui_Cancel_Search_Button_Text
source: Cancel
es: Cancelar
ru: Отменить

# Ui_Count_size_in_Bytes
source: Bytes
ru: Байты

# Ui_Count_size_in_Gigabytes
source: GB
ru: ГБ

# Ui_Count_size_in_Kilobytes
source: KB
ru: КБ

# Ui_Count_size_in_Megabytes
source: MB
ru: МБ

# Ui_Duplicated_size
source: , Duplicated size:
es: , Tamaño duplicado:
ru: , Дублированный размер:

# Ui_Duplicates_Sorting_Order_Ascending
source: Current sorting order is Ascending
es: Ordenación actual es Ascendente
ru: Текущий порядок сортировки - По возрастанию

# Ui_Duplicates_Sorting_Order_Descending
source: Current sorting order is Descending
es: Ordenación actual es Descendente
ru: Текущий порядок сортировки - По убыванию

# Ui_Duplicate_files_group_N
source: Duplicate files group #
es: El grupo de duplicados #
ru: Группа дубликатов #

# Ui_Errors_Clear
source: Clear errors list
es: Vaciar la lista de errores
ru: Очистить список ошибок

# Ui_Errors_Header_Message
source: Message
es: Mensaje
ru: Сообщение

# Ui_Errors_Header_Path
source: Path
es: Ruta
ru: Путь

# Ui_Errors_Header_Timestamp
source: Timestamp
es: Hora
ru: Время

# Ui_Errors_Header_Type
source: Type
es: Tipo
ru: Тип

# Ui_Errors_Tab_Header
source: Errors
es: Errores
ru: Ошибки

# Ui_Errors_Type_Error
source: Error
ru: Ошибка

# Ui_Errors_Type_Information
source: Information
es: Información
ru: Информация

# Ui_Errors_Type_Unknown
source: Unknown
es: Desconocido
ru: Неизвестный

# Ui_Errors_Type_Warning
source: Warning
es: Advertencia
ru: Предупреждение

# Ui_Extensions_Add
source: Add
es: Agregar
ru: Добавить

# Ui_Extensions_Cancel
source: Cancel
es: Cancelar
ru: Отменить

# Ui_Extensions_Extension_Header_Extension
source: Extension
es: Extensión
ru: Расширение

# Ui_Extensions_Extension_Header_Type
source: Type
es: Tipo
ru: Тип

# Ui_Extensions_GroupBox_Header
source: Extensions
es: Extensiones
ru: Расширения

# Ui_Extensions_Remove
source: Remove
es: Remover
ru: Удалить

# Ui_Extensions_Types_Header
source: Extension types
es: Tipos de extensión
ru: Типы расширений

# Ui_Extension_Type_Name_Audio
source: Audio
es: Audios
ru: Звук

# Ui_Extension_Type_Name_Binaries
source: Binary
es: Binarios
ru: Бинарные

# Ui_Extension_Type_Name_Documents
source: Document
es: Documentos
ru: Документы

# Ui_Extension_Type_Name_Images
source: Image
es: Imagines
ru: Картинки

# Ui_Extension_Type_Name_SourceCode
source: Source code
es: Códigos fuente
ru: Исходный Код

# Ui_Extension_Type_Name_Unknown
source: Other
es: Otros
ru: Другие

# Ui_Extension_Type_Name_Video
source: Video
es: Videos
ru: Видео

# Ui_Files
source: , Files:
es: , Archivos:
ru: , Файлы:

# Ui_File_Tree_Context_Menu_Open_File_In_Explorer
source: Open in the Explorer
es: Abrir en el Explorador
ru: Открыть в менеджере файлов

# Ui_Progress_Analyzing
source: Analyzing:
es: Analizando:
ru: Анализ:

# Ui_Progress_Comparing
source: Comparing:
es: Comparando:
ru: Сравнение:

# Ui_Progress_Duplicates_Search_Cancelled
source: Search Cancelled.
es: Búsqueda cancelada.
ru: Поиск Отменён.

# Ui_Progress_Duplicates_Search_Done
source: Done.
es: Listo.
ru: Готово.

# Ui_Progress_Scanning
source: Scanning files:
es: Escaneando archivos:
ru: Поиск файлов:

# Ui_Results_Auto_select_by_path
source: Auto Select by Path
es: Seleccionar por Ruta
ru: Авто Выбор по Пути

# Ui_Results_Clear_Results
source: Clear all results
es: Remover todos los resultados
ru: Очистить все результаты

# Ui_Results_Delete_Marked_Files
source: Delete Selected Files
es: Borrar Seleccionados
ru: Удалить Выбранные

# Ui_Results_Duplicated_Size
source: Duplicated Bytes:
es: Bytes Duplicados:
ru: Дубл. Байты:

# Ui_Results_Duplicates_Information_GroupBox_Header
source: Duplicates Information
es: Los Datos de los Duplicados
ru: Информация о Дубликатах

# Ui_Results_Duplicate_Groups_Count
source: File Groups:
es: Grupos de Archivos:
ru: Группы Файлов:

# Ui_Results_Page
source: Page
es: Pagina
ru: Страница

# Ui_Results_Reset_selection
source: Clear Selection
es: Remover Selección
ru: Отменить Выборку
